{
  "format": "layers-model",
  "generatedBy": "keras v2.2.4-tf",
  "convertedBy": "TensorFlow.js Converter v1.3.2",
  "modelTopology": {
    "keras_version": "2.2.4-tf",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Model",
      "config": {
        "name": "model",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                1,
                null,
                3
              ],
              "dtype": "float32",
              "sparse": false,
              "name": "input_1"
            },
            "name": "input_1",
            "inbound_nodes": []
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d",
              "trainable": true,
              "dtype": "float32",
              "filters": 48,
              "kernel_size": [
                5
              ],
              "strides": [
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv1d",
            "inbound_nodes": [
              [
                [
                  "input_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization",
              "trainable": true,
              "dtype": "float32",
              "axis": [
                2
              ],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization",
            "inbound_nodes": [
              [
                [
                  "conv1d",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.3,
              "noise_shape": null,
              "seed": null
            },
            "name": "dropout",
            "inbound_nodes": [
              [
                [
                  "batch_normalization",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_1",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [
                5
              ],
              "strides": [
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv1d_1",
            "inbound_nodes": [
              [
                [
                  "dropout",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_1",
              "trainable": true,
              "dtype": "float32",
              "axis": [
                2
              ],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_1",
            "inbound_nodes": [
              [
                [
                  "conv1d_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_1",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.3,
              "noise_shape": null,
              "seed": null
            },
            "name": "dropout_1",
            "inbound_nodes": [
              [
                [
                  "batch_normalization_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_2",
              "trainable": true,
              "dtype": "float32",
              "filters": 96,
              "kernel_size": [
                3
              ],
              "strides": [
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv1d_2",
            "inbound_nodes": [
              [
                [
                  "dropout_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_2",
              "trainable": true,
              "dtype": "float32",
              "axis": [
                2
              ],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_2",
            "inbound_nodes": [
              [
                [
                  "conv1d_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_2",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.3,
              "noise_shape": null,
              "seed": null
            },
            "name": "dropout_2",
            "inbound_nodes": [
              [
                [
                  "batch_normalization_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Masking",
            "config": {
              "name": "masking",
              "trainable": true,
              "dtype": "float32",
              "mask_value": 0
            },
            "name": "masking",
            "inbound_nodes": [
              [
                [
                  "dropout_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Bidirectional",
            "config": {
              "name": "bidirectional",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "class_name": "LSTM",
                "config": {
                  "name": "lstm",
                  "trainable": true,
                  "dtype": "float32",
                  "return_sequences": true,
                  "return_state": false,
                  "go_backwards": false,
                  "stateful": false,
                  "unroll": false,
                  "time_major": false,
                  "units": 128,
                  "activation": "tanh",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "recurrent_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "unit_forget_bias": true,
                  "kernel_regularizer": null,
                  "recurrent_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "recurrent_constraint": null,
                  "bias_constraint": null,
                  "dropout": 0.3,
                  "recurrent_dropout": 0.0,
                  "implementation": 2
                }
              },
              "merge_mode": "concat"
            },
            "name": "bidirectional",
            "inbound_nodes": [
              [
                [
                  "masking",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Bidirectional",
            "config": {
              "name": "bidirectional_1",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "class_name": "LSTM",
                "config": {
                  "name": "lstm_1",
                  "trainable": true,
                  "dtype": "float32",
                  "return_sequences": true,
                  "return_state": false,
                  "go_backwards": false,
                  "stateful": false,
                  "unroll": false,
                  "time_major": false,
                  "units": 128,
                  "activation": "tanh",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "recurrent_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "unit_forget_bias": true,
                  "kernel_regularizer": null,
                  "recurrent_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "recurrent_constraint": null,
                  "bias_constraint": null,
                  "dropout": 0.3,
                  "recurrent_dropout": 0.0,
                  "implementation": 2
                }
              },
              "merge_mode": "concat"
            },
            "name": "bidirectional_1",
            "inbound_nodes": [
              [
                [
                  "bidirectional",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Bidirectional",
            "config": {
              "name": "bidirectional_2",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "class_name": "LSTM",
                "config": {
                  "name": "lstm_2",
                  "trainable": true,
                  "dtype": "float32",
                  "return_sequences": false,
                  "return_state": false,
                  "go_backwards": false,
                  "stateful": false,
                  "unroll": false,
                  "time_major": false,
                  "units": 128,
                  "activation": "tanh",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "recurrent_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "unit_forget_bias": true,
                  "kernel_regularizer": null,
                  "recurrent_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "recurrent_constraint": null,
                  "bias_constraint": null,
                  "dropout": 0.3,
                  "recurrent_dropout": 0.0,
                  "implementation": 2
                }
              },
              "merge_mode": "concat"
            },
            "name": "bidirectional_2",
            "inbound_nodes": [
              [
                [
                  "bidirectional_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 345,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense",
            "inbound_nodes": [
              [
                [
                  "bidirectional_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          }
        ],
        "input_layers": [
          [
            "input_1",
            0,
            0
          ]
        ],
        "output_layers": [
          [
            "dense",
            0,
            0
          ]
        ]
      }
    },
    "training_config": {
      "loss": "sparse_categorical_crossentropy",
      "metrics": [
        "accuracy"
      ],
      "weighted_metrics": null,
      "sample_weight_mode": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "Adam",
          "learning_rate": 0.0010000000474974513,
          "decay": 0.0,
          "beta_1": 0.8999999761581421,
          "beta_2": 0.9990000128746033,
          "epsilon": 1e-07,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of2.bin",
        "group1-shard2of2.bin"
      ],
      "weights": [
        {
          "name": "batch_normalization/gamma",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/beta",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/moving_mean",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/moving_variance",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/gamma",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/beta",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/moving_mean",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/moving_variance",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/gamma",
          "shape": [
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/beta",
          "shape": [
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/moving_mean",
          "shape": [
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/moving_variance",
          "shape": [
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional/forward_lstm/kernel",
          "shape": [
            96,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional/forward_lstm/recurrent_kernel",
          "shape": [
            128,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional/forward_lstm/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional/backward_lstm/kernel",
          "shape": [
            96,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional/backward_lstm/recurrent_kernel",
          "shape": [
            128,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional/backward_lstm/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_1/forward_lstm_1/kernel",
          "shape": [
            256,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_1/forward_lstm_1/recurrent_kernel",
          "shape": [
            128,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_1/forward_lstm_1/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_1/backward_lstm_1/kernel",
          "shape": [
            256,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_1/backward_lstm_1/recurrent_kernel",
          "shape": [
            128,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_1/backward_lstm_1/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_2/forward_lstm_2/kernel",
          "shape": [
            256,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_2/forward_lstm_2/recurrent_kernel",
          "shape": [
            128,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_2/forward_lstm_2/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_2/backward_lstm_2/kernel",
          "shape": [
            256,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_2/backward_lstm_2/recurrent_kernel",
          "shape": [
            128,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_2/backward_lstm_2/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1d/kernel",
          "shape": [
            5,
            3,
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1d/bias",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1d_1/kernel",
          "shape": [
            5,
            48,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1d_1/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1d_2/kernel",
          "shape": [
            3,
            64,
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1d_2/bias",
          "shape": [
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/kernel",
          "shape": [
            256,
            345
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/bias",
          "shape": [
            345
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}