{
  "format": "layers-model",
  "generatedBy": "keras v2.2.4-tf",
  "convertedBy": "TensorFlow.js Converter v1.3.1.1",
  "modelTopology": {
    "keras_version": "2.2.4-tf",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Model",
      "config": {
        "name": "model_1",
        "layers": [
          {
            "name": "input_2",
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                1,
                null,
                4
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_2"
            },
            "inbound_nodes": []
          },
          {
            "name": "dense_3",
            "class_name": "Dense",
            "config": {
              "name": "dense_3",
              "trainable": true,
              "dtype": "float32",
              "units": 1024,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "input_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "dropout_3",
            "class_name": "Dropout",
            "config": {
              "name": "dropout_3",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.5,
              "noise_shape": null,
              "seed": null
            },
            "inbound_nodes": [
              [
                [
                  "dense_3",
                  0,
                  0,
                  {
                    "training": true
                  }
                ]
              ]
            ]
          },
          {
            "name": "lstm_5",
            "class_name": "LSTM",
            "config": {
              "name": "lstm_5",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": true,
              "return_state": false,
              "go_backwards": false,
              "stateful": true,
              "unroll": false,
              "time_major": false,
              "units": 512,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "recurrent_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 1
            },
            "inbound_nodes": [
              [
                [
                  "dropout_3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "lstm_6",
            "class_name": "LSTM",
            "config": {
              "name": "lstm_6",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": true,
              "return_state": false,
              "go_backwards": false,
              "stateful": true,
              "unroll": false,
              "time_major": false,
              "units": 512,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "recurrent_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 1
            },
            "inbound_nodes": [
              [
                [
                  "lstm_5",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "lstm_7",
            "class_name": "LSTM",
            "config": {
              "name": "lstm_7",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": true,
              "return_state": false,
              "go_backwards": false,
              "stateful": true,
              "unroll": false,
              "time_major": false,
              "units": 512,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "recurrent_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 1
            },
            "inbound_nodes": [
              [
                [
                  "lstm_6",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "lstm_8",
            "class_name": "LSTM",
            "config": {
              "name": "lstm_8",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": true,
              "return_state": false,
              "go_backwards": false,
              "stateful": true,
              "unroll": false,
              "time_major": false,
              "units": 512,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "recurrent_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 1
            },
            "inbound_nodes": [
              [
                [
                  "lstm_7",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "lstm_9",
            "class_name": "LSTM",
            "config": {
              "name": "lstm_9",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": true,
              "return_state": false,
              "go_backwards": false,
              "stateful": true,
              "unroll": false,
              "time_major": false,
              "units": 512,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "recurrent_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 1
            },
            "inbound_nodes": [
              [
                [
                  "lstm_8",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "dropout_4",
            "class_name": "Dropout",
            "config": {
              "name": "dropout_4",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.5,
              "noise_shape": null,
              "seed": null
            },
            "inbound_nodes": [
              [
                [
                  "lstm_9",
                  0,
                  0,
                  {
                    "training": true
                  }
                ]
              ]
            ]
          },
          {
            "name": "dense_4",
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 1024,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "dropout_4",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "dropout_5",
            "class_name": "Dropout",
            "config": {
              "name": "dropout_5",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.5,
              "noise_shape": null,
              "seed": null
            },
            "inbound_nodes": [
              [
                [
                  "dense_4",
                  0,
                  0,
                  {
                    "training": true
                  }
                ]
              ]
            ]
          },
          {
            "name": "dense_5",
            "class_name": "Dense",
            "config": {
              "name": "dense_5",
              "trainable": true,
              "dtype": "float32",
              "units": 4,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null,
                  "dtype": "float32"
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  "dtype": "float32"
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "dropout_5",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          }
        ],
        "input_layers": [
          [
            "input_2",
            0,
            0
          ]
        ],
        "output_layers": [
          [
            "dense_5",
            0,
            0
          ]
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of12.bin",
        "group1-shard2of12.bin",
        "group1-shard3of12.bin",
        "group1-shard4of12.bin",
        "group1-shard5of12.bin",
        "group1-shard6of12.bin",
        "group1-shard7of12.bin",
        "group1-shard8of12.bin",
        "group1-shard9of12.bin",
        "group1-shard10of12.bin",
        "group1-shard11of12.bin",
        "group1-shard12of12.bin"
      ],
      "weights": [
        {
          "name": "dense_3/kernel",
          "shape": [
            4,
            1024
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_3/bias",
          "shape": [
            1024
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_4/kernel",
          "shape": [
            512,
            1024
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_4/bias",
          "shape": [
            1024
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_5/kernel",
          "shape": [
            1024,
            4
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_5/bias",
          "shape": [
            4
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_5/kernel",
          "shape": [
            1024,
            2048
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_5/recurrent_kernel",
          "shape": [
            512,
            2048
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_5/bias",
          "shape": [
            2048
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_6/kernel",
          "shape": [
            512,
            2048
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_6/recurrent_kernel",
          "shape": [
            512,
            2048
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_6/bias",
          "shape": [
            2048
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_7/kernel",
          "shape": [
            512,
            2048
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_7/recurrent_kernel",
          "shape": [
            512,
            2048
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_7/bias",
          "shape": [
            2048
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_8/kernel",
          "shape": [
            512,
            2048
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_8/recurrent_kernel",
          "shape": [
            512,
            2048
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_8/bias",
          "shape": [
            2048
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_9/kernel",
          "shape": [
            512,
            2048
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_9/recurrent_kernel",
          "shape": [
            512,
            2048
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_9/bias",
          "shape": [
            2048
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}